use ГИБДД

select м.Марка, мд.Модель, тс.Год_выпуска, count ( ввс.Ид_ву) as Кол_во_людей_допущенных_к_управлению


from Транспортное_средство тс 
join Марка м on м.Ид_марки = тс.Марка
join Модель мд on мд.Ид_модели = тс.Модель
join Страховка с on с.Ид_транспортного_средства = тс.Ид_транспортного_средства
left join Водители_в_страховке ввс on ввс.Ид_страховки = с.Ид_страховки


where тс.Ид_транспортного_средства in 

(select с.Ид_транспортного_средства
from Страховка с 
left join Водители_в_страховке ввс on ввс.Ид_страховки = с.Ид_страховки
group by с.Ид_транспортного_средства
having count ( ввс.Ид_ву) > 2)

group by тс.Ид_транспортного_средства, м.Марка, мд.Модель, тс.Год_выпуска